# PhaseArrayIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PhaseArrayIterator Class
Members See Also
---
An iterator to a phase array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class PhaseArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class PhaseArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class PhaseArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..PhaseArrayIterator
# See Also
PhaseArrayIterator Members
Autodesk.Revit.DB Namespace